backend/app/controllers/api/v1/devices_controller.rb

  def index
    render json: { status: 200, devices: Device.all, message: "success" }
---
SELECT `devices`.* FROM `devices`

  def create
    device = Device.new(device_params)
    if device.save
---
INSERT INTO `devices` (`device_name`, `device_information`, `created_at`, `updated_at`) VALUES ('aa', 'aa', '2024-05-07 02:00:32.866923', '2024-05-07 02:00:32.866923')

  def destroy
    device = Device.find(params[:id])
    if device.destroy
---
SELECT `devices`.* FROM `devices` WHERE `devices`.`id` = 6 LIMIT 1
DELETE FROM `devices` WHERE `devices`.`id` = 6